IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM3_CONTROLSS_G0_EPWM3.xml
	<register id="CONTROLSS_G0_EPWM3_AQTSRCSEL" acronym="CONTROLSS_G0_EPWM3_AQTSRCSEL" offset="0x22" width="16" description="Action Qualifier Trigger Event Source Select Register">
		<bitfield id="T2SEL" width="4" begin="7" end="4" resetval="0x0" description="T2 Event Source Select Bits   0000: DCAEVT1  0001: DCAEVT2  0010: DCBEVT1  0011: DCBEVT2  0100: TZ1  0101: TZ2  0110: TZ3  0111: EPWMxSYNCI  1000: DCEVTFILT  Others: Reserved" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="T1SEL" width="4" begin="3" end="0" resetval="0x0" description="T1 Event Source Select Bits   0000: DCAEVT1  0001: DCAEVT2  0010: DCBEVT1  0011: DCBEVT2  0100: TZ1  0101: TZ2  0110: TZ3  0111: EPWMxSYNCI  1000: DCEVTFILT  Others: Reserved" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM3_PCCTL" acronym="CONTROLSS_G0_EPWM3_PCCTL" offset="0x28" width="16" description="PWM Chopper Control Register">
		<bitfield id="CHPDUTY" width="3" begin="10" end="8" resetval="0x0" description="Chopping Clock Duty Cycle   000: Duty = 1/8 [12.5%]  001: Duty = 2/8 [25.0%]  010: Duty = 3/8 [37.5%]  011: Duty = 4/8 [50.0%]  100: Duty = 5/8 [62.5%]  101: Duty = 6/8 [75.0%]  110: Duty = 7/8 [87.5%]  111: Reserved" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="CHPFREQ" width="3" begin="7" end="5" resetval="0x0" description="Chopping Clock Frequency   000: Divide by 1 [no prescale, = 12.5 MHz at 100 MHz TBCLK]  001: Divide by 2 [6.25 MHz at 100 MHz TBCLK]  010: Divide by 3 [4.16 MHz at 100 MHz TBCLK]  011: Divide by 4 [3.12 MHz at 100 MHz TBCLK]  100: Divide by 5 [2.50 MHz at 100 MHz TBCLK]  101: Divide by 6 [2.08 MHz at 100 MHz TBCLK]  110: Divide by 7 [1.78 MHz at 100 MHz TBCLK]  111: Divide by 8 [1.56 MHz at 100 MHz TBCLK]" range="7 - 5" rwaccess="R/W"/> 
		<bitfield id="OSHTWTH" width="4" begin="4" end="1" resetval="0x0" description="One-Shot Pulse Width   0000: 1 x EPWMCLK / 8 wide [ = 80 ns at 100 MHz EPWMCLK]  0001: 2 x EPWMCLK / 8 wide [ = 160 ns at 100 MHz EPWMCLK]  0010: 3 x EPWMCLK / 8 wide [ = 240 ns at 100 MHz EPWMCLK]  0011: 4 x EPWMCLK / 8 wide [ = 320 ns at 100 MHz EPWMCLK]  0100: 5 x EPWMCLK / 8 wide [ = 400 ns at 100 MHz EPWMCLK]  0101: 6 x EPWMCLK / 8 wide [ = 480 ns at 100 MHz EPWMCLK]  0110: 7 x EPWMCLK / 8 wide [ = 560 ns at 100 MHz EPWMCLK]  0111: 8 x EPWMCLK / 8 wide [ = 640 ns at 100 MHz EPWMCLK]  1000: 9 x EPWMCLK / 8 wide [ = 720 ns at 100 MHz EPWMCLK]  1001: 10 x EPWMCLK / 8 wide [ = 800 ns at 100 MHz EPWMCLK]  1010: 11 x EPWMCLK / 8 wide [ = 880 ns at 100 MHz EPWMCLK]  1011: 12 x EPWMCLK / 8 wide [ = 960 ns at 100 MHz EPWMCLK]  1100: 13 x EPWMCLK / 8 wide [ = 1040 ns at 100 MHz EPWMCLK]  1101: 14 x EPWMCLK / 8 wide [ = 1120 ns at 100 MHz EPWMCLK]  1110: 15 x EPWMCLK / 8 wide [ = 1200 ns at 100 MHz EPWMCLK]  1111: 16 x EPWMCLK / 8 wide [ = 1280 ns at 100 MHz EPWMCLK]" range="4 - 1" rwaccess="R/W"/> 
		<bitfield id="CHPEN" width="1" begin="0" end="0" resetval="0x0" description="PWM-Chopping Enable   0: Disable [bypass] PWM chopping function  1: Enable chopping function" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM3_VCAPCTL" acronym="CONTROLSS_G0_EPWM3_VCAPCTL" offset="0x30" width="16" description="Valley Capture Control Register">
		<bitfield id="EDGEFILTDLYSEL" width="1" begin="10" end="10" resetval="0x0" description="Valley Switching Mode Delay Selection   0: No delay applied to the edge filter output  1: HWDELAYVAL delay applied to the edge filter output" range="10" rwaccess="R/W"/> 
		<bitfield id="VDELAYDIV" width="3" begin="9" end="7" resetval="0x0" description="Valley Delay Mode Divide Enable   000: HWVDELVAL = SWVDELVAL  001: HWVDELVAL = VCNTVAL+SWVDELVAL  010: HWVDELVAL = VCNTVAL>>1+SWVDELVAL  011: HWVDELVAL = VCNTVAL>>2+SWVDELVAL  100: HWVDELVAL = VCNTVAL>>4+SWVDELVAL  Note: Delay value between the consecutive edge captures can optionally be divided by using these bits." range="9 - 7" rwaccess="R/W"/> 
		<bitfield id="TRIGSEL" width="3" begin="4" end="2" resetval="0x0" description="Status of Numbered of Captured Events   000: Capture sequence is triggered by software via writes to VCAPCTL[VCAPSTART].  001: Capture sequence is triggered by CNT_zero event.  010: Capture sequence is triggered by PRD_eq event.  011: Capture sequence is triggered by CNT_zero or PRD_eq event.  100: Capture sequence is triggered by DCAEVT1 event.  101: Capture sequence is triggered by DCAEVT2 event.  110: Capture sequence is triggered by DCBEVT1 event.  111: Capture sequence is triggered by DCBEVT2 event.  Note: Valley capture sequence triggered by the selected event in this register field. Once the chosen event occurs the capture sequence is armed. Event captures occur based of the event chosen in DCFCTL[SRCSEL] register.  Note: Same event may not be chosen in both DCFCTL[SRCSEL] and VCAPCTL[TRIGSEL] registers.  Note: Once the chosen event in VCAPCTL[TRIGSEL] occurs, irrespective of the current capture status, capture sequence is retriggered." range="4 - 2" rwaccess="R/W"/> 
		<bitfield id="VCAPSTART" width="1" begin="1" end="1" resetval="0x0" description="Valley Capture Start   0: Writing a 0 has no effect  1: Trigger the capture sequence once if VCAPCTL[TRIGSEL]=0x0  Note: This bit is used to start valley capture sequence through software. VCAPCTL[TRIGSEL] has to be chosen for software trigger for this bit to have any effect. Writing of 1 will result in one capture sequence trigger." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="VCAPE" width="1" begin="0" end="0" resetval="0x0" description="Valley Capture Enable/Disable   0: Disabled  1: Enabled" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM3_VCNTCFG" acronym="CONTROLSS_G0_EPWM3_VCNTCFG" offset="0x32" width="16" description="Valley Counter Config Register">
		<bitfield id="STOPEDGESTS" width="1" begin="15" end="15" resetval="0x0" description="Stop Edge Status Bit   0: Stop edge has not occurred  1: Stop edge occurred  Note: This bit is set only after the trigger sequence is armed [upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL]] and STOPEDGE occurs.  Note:This bit is reset by the occurrence of the trigger pulse selected through VCAPCTL[TRIGSEL]" range="15" rwaccess="R"/> 
		<bitfield id="STOPEDGE" width="4" begin="11" end="8" resetval="0x0" description="Counter Stop Edge Selection  Once the counter operation is armed, upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL] pulse - valley counter would stop counting upon the occurrence of chosen number of events thorough this bit field. Stop counting on occurrence of:   0000: Do not stop  0001  1st edge  0010: 2nd edge  0011: 3rd edge  ...  1,1,1,1: 15th edge" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="STARTEDGESTS" width="1" begin="7" end="7" resetval="0x0" description="Start Edge Status Bit   0: Start edge has not occurred  1: Start edge occurred  Note: This bit is set only after the trigger sequence is armed [upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL]] and STARTEDGE occurs.  Note:This bit is reset by the occurrence of the trigger pulse selected through VCAPCTL[TRIGSEL]" range="7" rwaccess="R"/> 
		<bitfield id="STARTEDGE" width="4" begin="3" end="0" resetval="0x0" description="Counter Start Edge Selection  Once the counter operation is armed, upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL] pulse - valley counter would start counting upon the occurrence of chosen number of events thorough this bit field. Start counting on occurrence of    0000: Do not start  0001: 1st edge  0010: 2nd edge  0011: 3rd edge  ...  1111: 15th edge" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM3_HRCNFG" acronym="CONTROLSS_G0_EPWM3_HRCNFG" offset="0x40" width="16" description="HRPWM Configuration Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities.">
		<bitfield id="LINESEL" width="2" begin="15" end="14" resetval="0x0" description="Delay Line Selection Bits: Selects which of the 4 delay lines for a particular ePWM/EPWM module to send to CALIN for calibration." range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="HRLOADB" width="2" begin="12" end="11" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPBHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPB_EQ [Translator Event CMPB-3]  " range="12 - 11" rwaccess="R/W"/> 
		<bitfield id="CTLMODEB" width="1" begin="10" end="10" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPBHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="10" rwaccess="R/W"/> 
		<bitfield id="EDGMODEB" width="2" begin="9" end="8" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPBHR]  10: MEP control of falling edge [CMPBHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SWAPAB" width="1" begin="7" end="7" resetval="0x0" description="Swap ePWM A &#38; B Output Signals  This bit enables the swapping of the A &#38; B signal outputs. The selection is as follows:   0: ePWMxA and ePWMxB outputs are unchanged.  1: ePWMxA signal appears on ePWMxB output and ePWMxB signal appears on ePWMxA output." range="7" rwaccess="R/W"/> 
		<bitfield id="AUTOCONV" width="1" begin="6" end="6" resetval="0x0" description="Auto Convert Delay Line Value  Selects whether the fractional duty cycle/period/phase in the CMPAHR/TBPRDHR/TBPHSHR register is automatically scaled by the MEP scale factor in the HRMSTEP register or manually scaled by calculations in application software. The SFO library function automatically updates the HRMSTEP register with the appropriate MEP scale factor.   0: Automatic HRMSTEP scaling is disabled.  1: Automatic HRMSTEP scaling is enabled.  If application software is manually scaling the fractional duty cycle, or phase [i.e. software sets CMPAHR = [fraction[PWMduty * PWMperiod] * MEP Scale Factor]&#38;#60;&#38;#60;8 + 0x080 for duty cycle], then this mode must be disabled." range="6" rwaccess="R/W"/> 
		<bitfield id="SELOUTB" width="1" begin="5" end="5" resetval="0x0" description="EPWMxB Output Select Bit  This bit selects which signal is output on the ePWMxB channel output. The inversion will take the high resolution mode into account and the inverted signal will contain any high resolution modification. The inversion takes place as the last step in modifying the ePWMxB signal.   0: ePWMxB output is normal.  1: ePWMxB output is inverted version of ePWMxA signal." range="5" rwaccess="R/W"/> 
		<bitfield id="HRLOAD" width="2" begin="4" end="3" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPAHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPA_EQ [Translator Event CMPA-3]  " range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="CTLMODE" width="1" begin="2" end="2" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPAHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="2" rwaccess="R/W"/> 
		<bitfield id="EDGMODE" width="2" begin="1" end="0" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPAHR]  10: MEP control of falling edge [CMPAHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM3_HRCNFG2" acronym="CONTROLSS_G0_EPWM3_HRCNFG2" offset="0x4E" width="16" description="HRPWM Configuration 2 Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities. Only 16 bit accesses are allowed for this register.  Debugger access in 32 bit mode may display incorrect values.">
		<bitfield id="NOBYPASS" width="1" begin="15" end="15" resetval="0x0" description="No Bypass Delay Line Update Bit: For internal test purposes, this bit disables the 1 SYSCLK cycle bypass before delay line is updated." range="15" rwaccess="R/W"/> 
		<bitfield id="DELLOADFRC" width="1" begin="14" end="14" resetval="0x0" description="Delay Line Load Software Force: For internal test purposes, software force generates a pulse which forces a delay line update [similar to PRD_eq/CNT_zero strobe]." range="14" rwaccess="R/W1TS"/> 
		<bitfield id="CTLMODEDBFED" width="2" begin="5" end="4" resetval="0x0" description="Shadow Mode Bit - selection should match DBCTL[LOADFEDMODE]  Selects the time event that loads the DBFEDHR shadow value into the active register.   00 Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01 Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10 Load on either CTR = Zero or CTR = PRD  11 Reserved" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="CTLMODEDBRED" width="2" begin="3" end="2" resetval="0x0" description="Shadow Mode Bit - selection should match DBCTL[LOADREDMODE]  Selects the time event that loads the DBREDHR shadow value into the active register.   00 Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01 Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10 Load on either CTR = Zero or CTR = PRD  11 Reserved" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="EDGMODEDB" width="2" begin="1" end="0" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00 HRPWM capability is disabled [default on reset]  01 MEP control of rising edge [DBREDHR]  10 MEP control of falling edge [DBFEDHR]  11 MEP control of both edges [rising edge of DBREDHR or falling edge of DBFEDHR ]" range="1 - 0" rwaccess="R/W"/>
	</register>
